package sango.gm.cmd;

public interface CmdSaveClientBBSRES {
	String saveMsg = "正在设置客户端{0}-{1}级别段登录公告，标题:《{2}》,包括{3}个活动";
	String cmdName = "设置客户端登录公告";
	String cmdDesc = "设置客户端登录公告 /set-tips ＜级别下线＞ ＜级别上限＞ ＜标题＞ （＜活动名称＞:＜活动内容＞）*";
	String paras[][][] = { 
			{ { cmdName },
				{ "级别下线", "玩家角色级别下线" }, 
				{ "级别上线", "玩家角色级别上线" }, 
				{ "标题", "提示标题" }, 
				{ "活动内容", "格式为”活动名称:活动内容“" }, 
			}, 
			{ { cmdName },
				{ "级别下线", "玩家角色级别下线" }, 
				{ "级别上线", "玩家角色级别上线" }, 
				{ "标题", "提示标题" }, 
				{ "活动1内容", "格式为”活动名称:活动内容“" }, 
				{ "活动2内容", "格式为”活动名称:活动内容“" }, 
			}, 
			{ { cmdName },
				{ "级别下线", "玩家角色级别下线" }, 
				{ "级别上线", "玩家角色级别上线" }, 
				{ "标题", "提示标题" }, 
				{ "活动1内容", "格式为”活动名称:活动内容“" }, 
				{ "活动2内容", "格式为”活动名称:活动内容“" }, 
				{ "活动3内容", "格式为”活动名称:活动内容“" }, 
			}, 
			{ { cmdName },
				{ "级别下线", "玩家角色级别下线" }, 
				{ "级别上线", "玩家角色级别上线" }, 
				{ "标题", "提示标题" }, 
				{ "活动1内容", "格式为”活动名称:活动内容“" }, 
				{ "活动2内容", "格式为”活动名称:活动内容“" }, 
				{ "活动3内容", "格式为”活动名称:活动内容“" }, 
				{ "活动4内容", "格式为”活动名称:活动内容“" }, 
			}, 
			};
}
